// Generated with util/create-component.js
import { ArrowUpOutlined } from "@ant-design/icons";
import { Card, Statistic } from "antd";
import React from "react";
import ZESheet from "../index";

import "@antv/s2-react/dist/style.min.css";
import { SheetComponent } from "@antv/s2-react";

// prepare server
import prepareServerForStories from "../../../util/prepareServerForStories";
prepareServerForStories();

export default {
  title: "ZESheet",
};

export const Basic = () => {
  const s2DataConfig = {
    fields: {
      rows: ["province", "city"],
      columns: ["type"],
      values: ["price"],
    },
    data: [
      {
        province: "浙江",
        city: "杭州",
        type: "笔",
        price: "1",
      },
      {
        province: "浙江",
        city: "杭州",
        type: "纸张",
        price: "2",
      },
      {
        province: "浙江",
        city: "舟山",
        type: "笔",
        price: "17",
      },
      {
        province: "浙江",
        city: "舟山",
        type: "纸张",
        price: "0.5",
      },
      {
        province: "吉林",
        city: "丹东",
        type: "笔",
        price: "8",
      },
      {
        province: "吉林",
        city: "白山",
        type: "笔",
        price: "9",
      },
      {
        province: "吉林",
        city: "丹东",
        type: " 纸张",
        price: "3",
      },
      {
        province: "吉林",
        city: "白山",
        type: "纸张",
        price: "1",
      },
    ],
  };

  return (
    <SheetComponent
      dataCfg={s2DataConfig}
      options={{
        width: 600,
        height: 600,
      }}
    />
  );
  // return <ZESheet s2DataConfig={s2DataConfig} s2Options={s2Options} />;
};

export const Example2 = () => {
  const data = [
    {
      type: "有信用卡",
      job: "白领",
      age: "18岁以下",
      city: "一二线城市",
      count: 76.32,
    },
    {
      type: "有信用卡",
      job: "白领",
      age: "18岁以下",
      city: "三四线城市",
      count: 86.32,
    },
    {
      type: "有信用卡",
      job: "白领",
      age: "19岁到25岁",
      city: "一二城市",
      count: 16.32,
    },
    {
      type: "有信用卡",
      job: "白领",
      age: "19岁到25岁",
      city: "三四线城市",
      count: 16.32,
    },
    {
      type: "有信用卡",
      job: "白领",
      age: "26岁到30岁",
      city: "一二城市",
      count: 26.3,
    },
    {
      type: "有信用卡",
      job: "白领",
      age: "26岁到30岁",
      city: "三四线城市",
      count: 46.32,
    },
    {
      type: "有信用卡",
      job: "白领",
      age: "30岁到35岁",
      city: "一二线城市",
      count: 96.32,
    },
    {
      type: "有信用卡",
      job: "白领",
      age: "30岁到35岁",
      city: "三四线城市",
      count: 86.32,
    },
    {
      type: "有信用卡",
      job: "白领",
      age: "36岁到40岁",
      city: "一二线城市",
      count: 86.32,
    },
    {
      type: "有信用卡",
      job: "白领",
      age: "36岁到40岁",
      city: "三四线城市",
      count: 76.32,
    },
    {
      type: "有信用卡",
      job: "蓝领",
      age: "18岁以下",
      city: "一二线城市",
      count: 46.32,
    },
    {
      type: "有信用卡",
      job: "蓝领",
      age: "18岁以下",
      city: "三四线城市",
      count: 66,
    },
    {
      type: "有信用卡",
      job: "蓝领",
      age: "19岁到25岁",
      city: "一二城市",
      count: 52,
    },
    {
      type: "有信用卡",
      job: "蓝领",
      age: "19岁到25岁",
      city: "三四线城市",
      count: 96.32,
    },
    {
      type: "有信用卡",
      job: "蓝领",
      age: "26岁到30岁",
      city: "一二城市",
      count: 94.32,
    },
    {
      type: "有信用卡",
      job: "蓝领",
      age: "26岁到30岁",
      city: "三四线城市",
      count: 26.3,
    },
    {
      type: "有信用卡",
      job: "蓝领",
      age: "30岁到35岁",
      city: "一二线城市",
      count: 46.32,
    },
    {
      type: "有信用卡",
      job: "蓝领",
      age: "30岁到35岁",
      city: "三四线城市",
      count: 7.32,
    },
    {
      type: "有信用卡",
      job: "蓝领",
      age: "36岁到40岁",
      city: "一二线城市",
      count: 32.32,
    },
    {
      type: "有信用卡",
      job: "蓝领",
      age: "36岁到40岁",
      city: "三四线城市",
      count: 76,
    },
    {
      type: "有信用卡",
      job: "学生",
      age: "18岁以下",
      city: "一二线城市",
      count: 16,
    },
    {
      type: "有信用卡",
      job: "学生",
      age: "18岁以下",
      city: "三四线城市",
      count: 6,
    },
    {
      type: "有信用卡",
      job: "学生",
      age: "19岁到25岁",
      city: "一二城市",
      count: 8,
    },
    {
      type: "有信用卡",
      job: "学生",
      age: "19岁到25岁",
      city: "三四线城市",
      count: 17.2,
    },
    {
      type: "有信用卡",
      job: "学生",
      age: "26岁到30岁",
      city: "一二城市",
      count: 16.32,
    },
    {
      type: "有信用卡",
      job: "学生",
      age: "26岁到30岁",
      city: "三四线城市",
      count: 36.2,
    },
    {
      type: "有信用卡",
      job: "学生",
      age: "30岁到35岁",
      city: "一二线城市",
      count: 6.32,
    },
    {
      type: "有信用卡",
      job: "学生",
      age: "30岁到35岁",
      city: "三四线城市",
      count: 26.32,
    },
    {
      type: "有信用卡",
      job: "学生",
      age: "36岁到40岁",
      city: "一二线城市",
      count: 8.32,
    },
    {
      type: "有信用卡",
      job: "学生",
      age: "36岁到40岁",
      city: "三四线城市",
      count: 76.32,
    },
    {
      type: "有信用卡",
      job: "其他",
      age: "18岁以下",
      city: "一二线城市",
      count: 4.32,
    },
    {
      type: "有信用卡",
      job: "其他",
      age: "18岁以下",
      city: "三四线城市",
      count: 40.3,
    },
    {
      type: "有信用卡",
      job: "其他",
      age: "19岁到25岁",
      city: "一二城市",
      count: 26.3,
    },
    {
      type: "有信用卡",
      job: "其他",
      age: "19岁到25岁",
      city: "三四线城市",
      count: 16.5,
    },
    {
      type: "有信用卡",
      job: "其他",
      age: "26岁到30岁",
      city: "一二城市",
      count: 56.2,
    },
    {
      type: "有信用卡",
      job: "其他",
      age: "26岁到30岁",
      city: "三四线城市",
      count: 36.3,
    },
    {
      type: "无信用卡",
      job: "白领",
      age: "18岁以下",
      city: "一二线城市",
      count: 16.32,
    },
    {
      type: "无信用卡",
      job: "白领",
      age: "18岁以下",
      city: "三四线城市",
      count: 76,
    },
    {
      type: "无信用卡",
      job: "白领",
      age: "19岁到25岁",
      city: "一二城市",
      count: 71.32,
    },
    {
      type: "无信用卡",
      job: "白领",
      age: "19岁到25岁",
      city: "三四线城市",
      count: 26.2,
    },
    {
      type: "无信用卡",
      job: "白领",
      age: "26岁到30岁",
      city: "一二城市",
      count: 66.32,
    },
    {
      type: "无信用卡",
      job: "白领",
      age: "26岁到30岁",
      city: "三四线城市",
      count: 76.32,
    },
    {
      type: "无信用卡",
      job: "白领",
      age: "30岁到35岁",
      city: "一二线城市",
      count: 96.32,
    },
    {
      type: "无信用卡",
      job: "白领",
      age: "30岁到35岁",
      city: "三四线城市",
      count: 80,
    },
    {
      type: "无信用卡",
      job: "白领",
      age: "36岁到40岁",
      city: "一二线城市",
      count: 61.32,
    },
    {
      type: "无信用卡",
      job: "白领",
      age: "36岁到40岁",
      city: "三四线城市",
      count: 30,
    },
    {
      type: "无信用卡",
      job: "蓝领",
      age: "18岁以下",
      city: "一二线城市",
      count: 83.3,
    },
    {
      type: "无信用卡",
      job: "蓝领",
      age: "18岁以下",
      city: "三四线城市",
      count: 76.32,
    },
    {
      type: "无信用卡",
      job: "蓝领",
      age: "19岁到25岁",
      city: "一二城市",
      count: 28,
    },
    {
      type: "无信用卡",
      job: "蓝领",
      age: "19岁到25岁",
      city: "三四线城市",
      count: 7.32,
    },
    {
      type: "无信用卡",
      job: "蓝领",
      age: "26岁到30岁",
      city: "一二城市",
      count: 30,
    },
    {
      type: "无信用卡",
      job: "蓝领",
      age: "26岁到30岁",
      city: "三四线城市",
      count: 6.5,
    },
    {
      type: "无信用卡",
      job: "蓝领",
      age: "30岁到35岁",
      city: "一二线城市",
      count: 6.32,
    },
    {
      type: "无信用卡",
      job: "蓝领",
      age: "30岁到35岁",
      city: "三四线城市",
      count: 72,
    },
    {
      type: "无信用卡",
      job: "蓝领",
      age: "36岁到40岁",
      city: "一二线城市",
      count: 36.32,
    },
    {
      type: "无信用卡",
      job: "蓝领",
      age: "36岁到40岁",
      city: "三四线城市",
      count: 74,
    },
    {
      type: "无信用卡",
      job: "学生",
      age: "18岁以下",
      city: "一二线城市",
      count: 25,
    },
    {
      type: "无信用卡",
      job: "学生",
      age: "18岁以下",
      city: "三四线城市",
      count: 40.2,
    },
    {
      type: "无信用卡",
      job: "学生",
      age: "19岁到25岁",
      city: "一二城市",
      count: 45,
    },
    {
      type: "无信用卡",
      job: "学生",
      age: "19岁到25岁",
      city: "三四线城市",
      count: 76.32,
    },
    {
      type: "无信用卡",
      job: "学生",
      age: "26岁到30岁",
      city: "一二城市",
      count: 26.32,
    },
    {
      type: "无信用卡",
      job: "学生",
      age: "26岁到30岁",
      city: "三四线城市",
      count: 2.2,
    },
    {
      type: "无信用卡",
      job: "学生",
      age: "30岁到35岁",
      city: "一二线城市",
      count: 16.32,
    },
    {
      type: "无信用卡",
      job: "学生",
      age: "30岁到35岁",
      city: "三四线城市",
      count: 70,
    },
    {
      type: "无信用卡",
      job: "学生",
      age: "36岁到40岁",
      city: "一二线城市",
      count: 69.32,
    },
    {
      type: "无信用卡",
      job: "学生",
      age: "36岁到40岁",
      city: "三四线城市",
      count: 90,
    },
    {
      type: "无信用卡",
      job: "其他",
      age: "18岁以下",
      city: "一二线城市",
      count: 69.3,
    },
    {
      type: "无信用卡",
      job: "其他",
      age: "18岁以下",
      city: "三四线城市",
      count: 86.72,
    },
    {
      type: "无信用卡",
      job: "其他",
      age: "19岁到25岁",
      city: "一二城市",
      count: 96.32,
    },
    {
      type: "无信用卡",
      job: "其他",
      age: "19岁到25岁",
      city: "三四线城市",
      count: 6.32,
    },
    {
      type: "无信用卡",
      job: "其他",
      age: "26岁到30岁",
      city: "一二城市",
      count: 73.32,
    },
    {
      type: "无信用卡",
      job: "其他",
      age: "26岁到30岁",
      city: "三四线城市",
      count: 6.2,
    },
    {
      type: "有信用卡",
      job: "其他",
      age: "36岁到40岁",
      city: "三四线城市",
      count: 26,
    },
    {
      type: "有信用卡",
      job: "其他",
      age: "30岁到35岁",
      city: "一二线城市",
      count: 46.32,
    },
    {
      type: "有信用卡",
      job: "其他",
      age: "30岁到35岁",
      city: "三四线城市",
      count: 61.32,
    },
    {
      type: "有信用卡",
      job: "其他",
      age: "36岁到40岁",
      city: "一二线城市",
      count: 38.32,
    },
    {
      type: "有信用卡",
      job: "其他",
      age: "36岁到40岁",
      city: "三四线城市",
      count: 26,
    },
    {
      type: "无信用卡",
      job: "其他",
      age: "30岁到35岁",
      city: "一二线城市",
      count: 69.2,
    },
    {
      type: "无信用卡",
      job: "其他",
      age: "30岁到35岁",
      city: "三四线城市",
      count: 7,
    },
    {
      type: "无信用卡",
      job: "其他",
      age: "36岁到40岁",
      city: "一二线城市",
      count: 62.12,
    },
    {
      type: "无信用卡",
      job: "其他",
      age: "36岁到40岁",
      city: "三四线城市",
      count: 37.0,
    },
    {
      type: "其他",
      job: "白领",
      age: "18岁以下",
      city: "一二线城市",
      count: 26.32,
    },
    {
      type: "其他",
      job: "白领",
      age: "18岁以下",
      city: "三四线城市",
      count: 76.2,
    },
    {
      type: "其他",
      job: "白领",
      age: "19岁到25岁",
      city: "一二城市",
      count: 16.2,
    },
    {
      type: "其他",
      job: "白领",
      age: "19岁到25岁",
      city: "三四线城市",
      count: 30.2,
    },
    {
      type: "其他",
      job: "白领",
      age: "26岁到30岁",
      city: "一二城市",
      count: 46.32,
    },
    {
      type: "其他",
      job: "白领",
      age: "26岁到30岁",
      city: "三四线城市",
      count: 42.32,
    },
    {
      type: "其他",
      job: "蓝领",
      age: "18岁以下",
      city: "一二线城市",
      count: 96.32,
    },
    {
      type: "其他",
      job: "蓝领",
      age: "18岁以下",
      city: "三四线城市",
      count: 76.32,
    },
    {
      type: "其他",
      job: "蓝领",
      age: "19岁到25岁",
      city: "一二城市",
      count: 65.32,
    },
    {
      type: "其他",
      job: "蓝领",
      age: "19岁到25岁",
      city: "三四线城市",
      count: 56,
    },
    {
      type: "其他",
      job: "蓝领",
      age: "26岁到30岁",
      city: "一二城市",
      count: 76.3,
    },
    {
      type: "其他",
      job: "蓝领",
      age: "26岁到30岁",
      city: "三四线城市",
      count: 72.2,
    },
    {
      type: "其他",
      job: "蓝领",
      age: "30岁到35岁",
      city: "一二线城市",
      count: 86.32,
    },
    {
      type: "其他",
      job: "蓝领",
      age: "30岁到35岁",
      city: "三四线城市",
      count: 11.32,
    },
    {
      type: "其他",
      job: "蓝领",
      age: "36岁到40岁",
      city: "一二线城市",
      count: 26.32,
    },
    {
      type: "其他",
      job: "蓝领",
      age: "36岁到40岁",
      city: "三四线城市",
      count: 88.32,
    },
    {
      type: "其他",
      job: "学生",
      age: "18岁以下",
      city: "一二线城市",
      count: 79.32,
    },
    {
      type: "其他",
      job: "学生",
      age: "18岁以下",
      city: "三四线城市",
      count: 42.32,
    },
    {
      type: "其他",
      job: "学生",
      age: "19岁到25岁",
      city: "一二城市",
      count: 40,
    },
    {
      type: "其他",
      job: "学生",
      age: "19岁到25岁",
      city: "三四线城市",
      count: 7.2,
    },
    {
      type: "其他",
      job: "学生",
      age: "26岁到30岁",
      city: "一二城市",
      count: 25.5,
    },
    {
      type: "其他",
      job: "学生",
      age: "26岁到30岁",
      city: "三四线城市",
      count: 26.32,
    },
    {
      type: "其他",
      job: "学生",
      age: "30岁到35岁",
      city: "一二线城市",
      count: 38.32,
    },
    {
      type: "其他",
      job: "学生",
      age: "30岁到35岁",
      city: "三四线城市",
      count: 28.32,
    },
    {
      type: "其他",
      job: "学生",
      age: "36岁到40岁",
      city: "一二线城市",
      count: 76.32,
    },
    {
      type: "其他",
      job: "学生",
      age: "36岁到40岁",
      city: "三四线城市",
      count: 10.32,
    },
    {
      type: "其他",
      job: "其他",
      age: "18岁以下",
      city: "一二线城市",
      count: 50.2,
    },
    {
      type: "其他",
      job: "其他",
      age: "18岁以下",
      city: "三四线城市",
      count: 46.2,
    },
    {
      type: "其他",
      job: "其他",
      age: "19岁到25岁",
      city: "一二城市",
      count: 66.2,
    },
    {
      type: "其他",
      job: "其他",
      age: "19岁到25岁",
      city: "三四线城市",
      count: 36.3,
    },
    {
      type: "其他",
      job: "其他",
      age: "26岁到30岁",
      city: "一二城市",
      count: 16.2,
    },
    {
      type: "其他",
      job: "其他",
      age: "26岁到30岁",
      city: "三四线城市",
      count: 46.2,
    },
    {
      type: "其他",
      job: "白领",
      age: "30岁到35岁",
      city: "一二线城市",
      count: 26.32,
    },
    {
      type: "其他",
      job: "白领",
      age: "30岁到35岁",
      city: "三四线城市",
      count: 16.32,
    },
    {
      type: "其他",
      job: "白领",
      age: "36岁到40岁",
      city: "一二线城市",
      count: 66.32,
    },
    {
      type: "其他",
      job: "白领",
      age: "36岁到40岁",
      city: "三四线城市",
      count: 18.32,
    },
    {
      type: "其他",
      job: "其他",
      age: "30岁到35岁",
      city: "一二线城市",
      count: 26.32,
    },
    {
      type: "其他",
      job: "其他",
      age: "30岁到35岁",
      city: "三四线城市",
      count: 48.32,
    },
    {
      type: "其他",
      job: "其他",
      age: "36岁到40岁",
      city: "一二线城市",
      count: 31.32,
    },
    {
      type: "其他",
      job: "其他",
      age: "36岁到40岁",
      city: "三四线城市",
      count: 77.32,
    },
  ];

  const s2DataConfig = {
    fields: {
      rows: ["type", "job"],
      columns: ["age", "city"],
      values: ["count"],
      valueInCols: true,
    },
    data,
  };

  return (
    <SheetComponent
      dataCfg={s2DataConfig}
      options={{
        width: 600,
        height: 480,
        hierarchyType: "tree",
        showSeriesNumber: false,
      }}
    />
  );
  // return <ZESheet s2DataConfig={s2DataConfig} s2Options={s2Options as any} />;
};

export const Table = () => {
  const data = [
    {
      province: "浙江",
      city: "杭州",
      type: "笔",
      price: "1",
    },
    {
      province: "浙江",
      city: "杭州",
      type: "纸张",
      price: "2",
    },
    {
      province: "浙江",
      city: "舟山",
      type: "笔",
      price: "17",
    },
    {
      province: "浙江",
      city: "舟山",
      type: "纸张",
      price: "6",
    },
    {
      province: "吉林",
      city: "丹东",
      type: "笔",
      price: "8",
    },
    {
      province: "吉林",
      city: "白山",
      type: "笔",
      price: "12",
    },
    {
      province: "吉林",
      city: "丹东",
      type: "纸张",
      price: "3",
    },
    {
      province: "吉林",
      city: "白山",
      type: "纸张",
      price: "25",
    },
    {
      province: "浙江",
      city: "杭州",
      type: "笔",
      cost: "0.5",
    },
    {
      province: "浙江",
      city: "杭州",
      type: "纸张",
      cost: "20",
    },
    {
      province: "浙江",
      city: "舟山",
      type: "笔",
      cost: "1.7",
    },
    {
      province: "浙江",
      city: "舟山",
      type: "纸张",
      cost: "0.12",
    },
    {
      province: "吉林",
      city: "丹东",
      type: "笔",
      cost: "10",
    },
    {
      province: "吉林",
      city: "白山",
      type: "笔",
      cost: "9",
    },
    {
      province: "吉林",
      city: "丹东",
      type: "纸张",
      cost: "3",
    },
    {
      province: "吉林",
      city: "白山",
      type: "纸张",
      cost: "1",
    },
  ];

  const s2DataConfig = {
    fields: {
      columns: ["province", "city", "type", "price", "cost"],
    },
    meta: [
      {
        field: "province",
        name: "省份",
      },
      {
        field: "city",
        name: "城市",
      },
      {
        field: "type",
        name: "商品类别",
      },
      {
        field: "price",
        name: "价格",
      },
      {
        field: "cost",
        name: "成本",
      },
    ],
    data,
  };

  return (
    <SheetComponent
      sheetType="table"
      dataCfg={s2DataConfig}
      options={{
        width: 600,
        height: 480,
        showSeriesNumber: true,
      }}
    />
  );

  // return (
  //   <ZESheet
  //     sheetType="table"
  //     s2DataConfig={s2DataConfig}
  //     s2Options={s2Options as any}
  //   />
  // );
};

export const ZHYReport1 = () => {
  const data = [
    {
      _id: "上海商贸单元饿了么",
      门店_地理位置_商贸单元: "上海商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 161740.63,
      上月实销: 33374.46,
    },
    {
      _id: "上海商贸单元美团",
      门店_地理位置_商贸单元: "上海商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 108777.5,
      上月实销: 34081.9,
    },
    {
      _id: "上海商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "上海商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 2989.4,
      上月实销: 83,
    },
    {
      _id: "东莞商贸单元美团",
      门店_地理位置_商贸单元: "东莞商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 217687.34,
      上月实销: 86383.44,
    },
    {
      _id: "东莞商贸单元饿了么",
      门店_地理位置_商贸单元: "东莞商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 40492.46,
      上月实销: 13138.62,
    },
    {
      _id: "东莞商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "东莞商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 9557.2,
      上月实销: 447,
    },
    {
      _id: "北京商贸单元美团",
      门店_地理位置_商贸单元: "北京商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 339900.45,
      上月实销: 83488.89,
    },
    {
      _id: "北京商贸单元饿了么",
      门店_地理位置_商贸单元: "北京商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 187277.88,
      上月实销: 40411.5,
    },
    {
      _id: "北京商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "北京商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 9964.7,
      上月实销: 376.7,
    },
    {
      _id: "四川商贸单元美团",
      门店_地理位置_商贸单元: "四川商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 69877.11,
      上月实销: 24577.29,
    },
    {
      _id: "四川商贸单元饿了么",
      门店_地理位置_商贸单元: "四川商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 35550.02,
      上月实销: 7017.38,
    },
    {
      _id: "四川商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "四川商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 2984,
      上月实销: 80.2,
    },
    {
      _id: "天津商贸单元美团",
      门店_地理位置_商贸单元: "天津商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 34616.8,
      上月实销: 10951.6,
    },
    {
      _id: "天津商贸单元饿了么",
      门店_地理位置_商贸单元: "天津商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 33068.53,
      上月实销: 7406.27,
    },
    {
      _id: "天津商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "天津商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 1156.2,
      上月实销: 0,
    },
    {
      _id: "安徽商贸单元美团",
      门店_地理位置_商贸单元: "安徽商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 110936.78,
      上月实销: 26600.16,
    },
    {
      _id: "安徽商贸单元饿了么",
      门店_地理位置_商贸单元: "安徽商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 104067.8,
      上月实销: 16665.9,
    },
    {
      _id: "安徽商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "安徽商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 4946.5,
      上月实销: 122.4,
    },
    {
      _id: "山东商贸单元美团",
      门店_地理位置_商贸单元: "山东商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 68547.7,
      上月实销: 19215.06,
    },
    {
      _id: "山东商贸单元饿了么",
      门店_地理位置_商贸单元: "山东商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 38111.89,
      上月实销: 7014.98,
    },
    {
      _id: "山东商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "山东商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 1335.2,
      上月实销: 118.6,
    },
    {
      _id: "广州商贸单元美团",
      门店_地理位置_商贸单元: "广州商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 212220,
      上月实销: 65149.97,
    },
    {
      _id: "广州商贸单元饿了么",
      门店_地理位置_商贸单元: "广州商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 47543.3,
      上月实销: 13456.7,
    },
    {
      _id: "广州商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "广州商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 7137.6,
      上月实销: 186.1,
    },
    {
      _id: "江苏商贸单元美团",
      门店_地理位置_商贸单元: "江苏商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 130307.24,
      上月实销: 40172.85,
    },
    {
      _id: "江苏商贸单元饿了么",
      门店_地理位置_商贸单元: "江苏商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 107757.48,
      上月实销: 22910.89,
    },
    {
      _id: "江苏商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "江苏商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 2914.3,
      上月实销: 230.4,
    },
    {
      _id: "江西商贸单元美团",
      门店_地理位置_商贸单元: "江西商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 98906.36,
      上月实销: 35153.66,
    },
    {
      _id: "江西商贸单元饿了么",
      门店_地理位置_商贸单元: "江西商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 62549.5,
      上月实销: 16849.52,
    },
    {
      _id: "江西商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "江西商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 2118,
      上月实销: 169.2,
    },
    {
      _id: "河北商贸单元美团",
      门店_地理位置_商贸单元: "河北商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 45338.1,
      上月实销: 12584.32,
    },
    {
      _id: "河北商贸单元饿了么",
      门店_地理位置_商贸单元: "河北商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 19424.08,
      上月实销: 3558.38,
    },
    {
      _id: "河北商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "河北商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 1608.1,
      上月实销: 0,
    },
    {
      _id: "河南商贸单元美团",
      门店_地理位置_商贸单元: "河南商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 203463.39,
      上月实销: 46963.6,
    },
    {
      _id: "河南商贸单元饿了么",
      门店_地理位置_商贸单元: "河南商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 52814.3,
      上月实销: 8623.19,
    },
    {
      _id: "河南商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "河南商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 4796.2,
      上月实销: 0,
    },
    {
      _id: "浙江商贸单元饿了么",
      门店_地理位置_商贸单元: "浙江商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 104878.53,
      上月实销: 25706,
    },
    {
      _id: "浙江商贸单元美团",
      门店_地理位置_商贸单元: "浙江商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 97749.78,
      上月实销: 32713.17,
    },
    {
      _id: "浙江商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "浙江商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 1625.9,
      上月实销: 180.7,
    },
    {
      _id: "深圳商贸单元美团",
      门店_地理位置_商贸单元: "深圳商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 450874.37,
      上月实销: 122558.88,
    },
    {
      _id: "深圳商贸单元饿了么",
      门店_地理位置_商贸单元: "深圳商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 100309.67,
      上月实销: 22280.35,
    },
    {
      _id: "深圳商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "深圳商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 17974.9,
      上月实销: 1389.5,
    },
    {
      _id: "湖北市外业务单元美团",
      门店_地理位置_商贸单元: "湖北市外业务单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 819982.82,
      上月实销: 149067.64,
    },
    {
      _id: "湖北市外业务单元饿了么",
      门店_地理位置_商贸单元: "湖北市外业务单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 501366.38,
      上月实销: 73303.15,
    },
    {
      _id: "湖北市外业务单元微信小程序/外卖",
      门店_地理位置_商贸单元: "湖北市外业务单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 18668.6,
      上月实销: 551.1,
    },
    {
      _id: "湖南商贸单元美团",
      门店_地理位置_商贸单元: "湖南商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 209597.33,
      上月实销: 54681.25,
    },
    {
      _id: "湖南商贸单元饿了么",
      门店_地理位置_商贸单元: "湖南商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 125160.4,
      上月实销: 22951.39,
    },
    {
      _id: "湖南商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "湖南商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 11741.1,
      上月实销: 411.5,
    },
    {
      _id: "福建商贸单元美团",
      门店_地理位置_商贸单元: "福建商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 34961.51,
      上月实销: 14663.97,
    },
    {
      _id: "福建商贸单元饿了么",
      门店_地理位置_商贸单元: "福建商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 27588,
      上月实销: 11154.94,
    },
    {
      _id: "福建商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "福建商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 1189.7,
      上月实销: 0,
    },
    {
      _id: "西安商贸单元美团",
      门店_地理位置_商贸单元: "西安商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 21191.36,
      上月实销: 18335.67,
    },
    {
      _id: "西安商贸单元饿了么",
      门店_地理位置_商贸单元: "西安商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 4803.93,
      上月实销: 7827.46,
    },
    {
      _id: "西安商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "西安商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 935.4,
      上月实销: 39.9,
    },
    {
      _id: "重庆商贸单元美团",
      门店_地理位置_商贸单元: "重庆商贸单元",
      渠道: {
        _id: "美团",
        名称: "美团",
      },
      总实销: 112256.98,
      上月实销: 38377.81,
    },
    {
      _id: "重庆商贸单元饿了么",
      门店_地理位置_商贸单元: "重庆商贸单元",
      渠道: {
        _id: "饿了么",
        名称: "饿了么",
      },
      总实销: 21189.69,
      上月实销: 5064.37,
    },
    {
      _id: "重庆商贸单元微信小程序/外卖",
      门店_地理位置_商贸单元: "重庆商贸单元",
      渠道: {
        _id: "微信小程序/外卖",
        名称: "微信小程序/外卖",
      },
      总实销: 1632.2,
      上月实销: 144.7,
    },
  ].map((d) => ({ ...d, 渠道: d.渠道._id }));

  const s2DataConfig = {
    fields: {
      rows: ["门店_地理位置_商贸单元", "渠道"],
      values: ["总实销", "上月实销"],
    },
    meta: [
      {
        field: "门店_地理位置_商贸单元",
        // 修改展示名称
        name: "商贸单元",
        // 格式化展示，但无法对object类型的数据进行格式化
        formatter: (v) => {
          console.log(v);
          return v;
        },
      },
    ],
    // data需转换为扁平结构的数据
    data,
    // 如果需要展示小计/总计的话，需要提前算好统计数据
    totalData: [
      {
        门店_地理位置_商贸单元: "上海商贸单元",
        总实销: 161740.63,
        上月实销: 33374.46,
      },
    ],
  };

  return (
    <SheetComponent
      dataCfg={s2DataConfig}
      options={{
        width: 600,
        height: 480,
        totals: {
          row: {
            showSubTotals: true,
            // 控制小计展示在上面还是下面
            reverseSubLayout: false,
            subTotalsDimensions: ["门店_地理位置_商贸单元"],
          },
        },
      }}
    />
  );
};
